---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopsOutsideFaceSplitterTooShort
source: html/09d1f74b-67a2-6432-26c1-2d84b5edcd9f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopsOutsideFaceSplitterTooShort Property

Some of the lines drawn lie outside of the boundary of the face being split. All lines used to split a face must be contained
 within the face being split and cannot intersect or overlap any of the boundaries of that face.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopsOutsideFaceSplitterTooShort { get; }
```